Revit 2026 API
Face.Triangulate Method
Returns a triangular mesh approximation to the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public Mesh Triangulate()
Public Function Triangulate As Mesh
public:
Mesh^ Triangulate()
member Triangulate : unit -> Mesh
Return Value
Mesh
Remarks
Tolerance of approximation is defined internally by Revit to be adequate for display purposes.
See Also
Reference
Face Class
Triangulate Overload
Autodesk.Revit.DB Namespace